<?php

namespace Database\Seeders;

use App\Models\Alat;
use Illuminate\Database\Seeder;

class AlatSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {

        $a = new Alat();
        $a->naziv = 'Транслитератор';
        $a->opis = 'Овај додатак обезбеђује безбедно решење за конверзију WordPress садржаја између ћириличног и латиничног писма. Израђен да буде кориснички пријатељски и лак, олакшава процес конверзије са минималним кликовима. Такође укључује подршку за јединствене скраћене кодове, омогућавајући селективну транслитерацију одређених делова садржаја и обезбеђујући изузетну флексибилност у приказу садржаја. Направите свој сајт латиничним сада!';
        $a->url = 'https://wordpress.org/plugins/serbian-transliteration/';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Ћирилични permalink-ови';
        $a->opis = "Овај додатак аутоматски ће превести URL трајних линкова када сачувате нову страницу или објаву са насловом написаним ћирилицом.
        Постоје унапред подешене опције за романизацију за све главне језике који користе ћирилично писмо: руски, украјински, казахстански, белоруски, српски, тајландски, бугарски, киргиски, босански, монголски и македонски.
        Додатак такође може извршити романизацију трајних линкова за већ постојеће објаве, категорије, производе или друге ставке са насловом написаним ћирилицом.";
        $a->url = 'https://wordpress.org/plugins/cyrillic-slugs/';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Конвертор латинице у ћирилицу';
        $a->opis = 'На веб страници постоје два поља за унос текста. Једно од њих (ЛЕВО) је намењено за унос текста на ћирилици, док је друго поље (ДЕСНО) за унос текста на латиници. Изнад поља за унос текста, имамо две опције за превођење текста. Прва опција је да преведете текст са ћирилице на латиницу, док је друга опција да преведете текст са латинице на ћирилицу. Када унесете текст у поље за унос текста, кликните на једну од опција за превођење текста. Након тога, текст ће бити преведен у друго поље за унос текста.';
        $a->url = 'https://www.konvertor.co.rs/index.php';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Конвертор за Microsoft Word';
        $a->opis = 'Уколико често куцате текстове у Ворду, сигурно сте барем једном имали потребу да пребаците ћирилични текст на латиницу или да, текст откуцан на латиници, преведете у ћирилицу.
        Да бисте лако и брзо пресловили текст, потребно је да инсталирате одговарајући plugin или макро, како бисте једним кликом могли да извршите жељену конверзију. У наставку текста вам доносимо неколико различитих опција које можете употребити.';
        $a->url = 'https://latinicaucirilicu.rs/konvertor-za-word';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Конвертор за Microsoft Excel';
        $a->opis = 'За разлику од ћирилично-латиничних конвертора за Word, кад је реч о конверзији текста унутар Excel-a, опције су знатно сужене. На овој страници су тренутно 2 доступна додатка која ће вам омогућити да пресловите ћирилицу у латиницу унутар овог програма.
        Подржане су све верзије Microsoft Excel-a: Excel 2007, Excel 2010, Excel 2013, Excel 2016, и најновији Excel 2019.';
        $a->url = 'https://latinicaucirilicu.rs/konvertor-za-excel';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Онлајн пресловљавање ћирилица - латиница';
        $a->opis = 'Брзо и прецизно пребаците текст са латинице на ћирилицу и са ћирилице на латиницу.
        Довољно је само да откуцате или налепите (copy - paste) ваш текст у поље које се налази испод и систем ће аутоматски извршити конверзију.';
        $a->url = 'https://latinicaucirilicu.rs/';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Tradukka';
        $a->opis = 'На веб страници постоје два поља за унос текста. Такође, постоје и опције за биранје језика превођења. Можемо да изаберемо да једно поље буде на ћирилици, а друго на латиници. Такође, можемо да изаберемо да оба поља буду на ћирилици или оба на латиници. Када унесете текст у поље за унос текста, кликните на једну од опција за превођење текста. Након тога, текст ће бити преведен у друго поље за унос текста. Текст се аутоматски преводи, без потребе да кликнемо дугме које би покренуло превођење.';
        $a->url = 'https://tradukka.com/translate/sr-cyrl/sr-latn/';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Ћирилизатор';
        $a->opis = 'Сајт је подељен на два дела. Горњи део је намењен за унос латинице. Испод поља се налазе дугмад за конвертовање у ћирилицу, као и опција да конвертовање у ћирилицу - дуал распоред. Доле се налази поље за унос текста на ћирилици. Испод поља се налазе дугмад за конвертовање у латиницу, као и опција да конвертовање у латиницу - дуал распоред. Када унесете текст у поље за унос текста, кликните на једну од опција за превођење текста. Након тога, текст ће бити преведен у друго поље за унос текста.';
        $a->url = 'http://rvukovic.net/cirilizator.html';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Латиница у ћирилицу';
        $a->opis = 'Алат има више опција. Главне опције су онлине конвертор, конвертор за Ворд, конвертор за Ексел и ћирилизатор. Онлине конвертор је намењен за унос текста на латиници и превођење у ћирилицу. На страници имамо два поља за унос текста. Изнад сваког поља за унос имамо опцију да изаберемо да ли ћемо уносити текст на латиници, ћирилици, ”аутоматски закључи”, ошишана латиница, YUSCII латинице, YUSCII ћирилице. Када унесете текст у поље за унос текста, он се аутоматски преведе у друго поље за унос текста.';
        $a->url = 'https://latinicaucirilicu.rs/';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Ћирилична корисничка имена        ';
        $a->opis = 'Ова опција омогућава креирање корисника са корисничким именима која садрже Ћириличне карактере. ';
        $a->url = 'https://wordpress.org/plugins/allow-cyrillic-usernames/';
        $a->objavljen = true;
        $a->save();

    }
}
