<?php

namespace Database\Seeders;

use App\Models\Alat;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class AlatSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $a = new Alat();
        $a->naziv = 'Translate WordPress with GTranslate';
        $a->opis = "Преведи WordPress помоћу Google Translate мултијезичког додатка како бисте направили ваш веб сајт вишејезичким. Потпуна вишејезичка решења за WordPress.";
        $a->url = 'https://wordpress.org/plugins/gtranslate/';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Translating WordPress';
        $a->opis = 'Алатка за превођење на WordPress је моћна и кориснички прилагођена платформа која је дизајнирана да олакша процес превођења за вебсајтове који користе WordPress. Служи као централизовано место где корисници могу да допринесу преводима за теме, додатке и основни софтвер WordPress-а на различите језике, омогућавајући глобалној аудиторији да приступи садржају на њиховом преферираном језику.';
        $a->url = 'https://wordpress.org/plugins/gtranslate/';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'WordPress translation plugin that anyone can use';
        $a->opis = 'TranslatePress је моћан додатак за превођење који омогућава лако превођење вашег веб сајта на WordPress-у на различите језике. Ова алатка има интуитивни интерфејс који омогућава корисницима да преводе садржај директно на веб страницама, уживајући у реалном прегледу превода. С TranslatePress можете да преводите све делове вашег веб сајта, укључујући текстове, наслове, меније, образаце за контакт и друге елементе, без потребе за специјалним вештинама превођења. Омогућава вам да лако промените и уређујете преводе директно на вашем веб сајту, што значајно олакшава процес превођења и прилагођавања садржаја различитим аудиторијама. Са додатком TranslatePress, превођење вашег веб сајта на више језика постаје једноставно и ефикасно, отварајући могућности за глобалну доступност вашег садржаја.';
        $a->url = 'https://translatepress.com/';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Latinica у ћирилицу';
        $a->opis = 'На веб страници постоје два поља за унос текста. Једно од њих (ЛЕВО) је намењено за унос текста на ћирилици, док је друго поље (ДЕСНО) за унос текста на латиници. Изнад поља за унос текста, имамо две опције за превођење текста. Прва опција је да преведете текст са ћирилице на латиницу, док је друга опција да преведете текст са латинице на ћирилицу. Када унесете текст у поље за унос текста, кликните на једну од опција за превођење текста. Након тога, текст ће бити преведен у друго поље за унос текста.';
        $a->url = 'https://www.konvertor.co.rs/index.php';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Tradukka';
        $a->opis = 'На веб страници постоје два поља за унос текста. Такође, постоје и опције за биранје језика превођења. Можемо да изаберемо да једно поље буде на ћирилици, а друго на латиници. Такође, можемо да изаберемо да оба поља буду на ћирилици или оба на латиници. Када унесете текст у поље за унос текста, кликните на једну од опција за превођење текста. Након тога, текст ће бити преведен у друго поље за унос текста. Текст се аутоматски преводи, без потребе да кликнемо дугме које би покренуло превођење.';
        $a->url = 'https://tradukka.com/translate/sr-cyrl/sr-latn/';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Ćirilizator';
        $a->opis = 'Сајт је подељен на два дела. Горњи део је намењен за унос латинице. Испод поља се налазе дугмад за конвертовање у ћирилицу, као и опција да конвертовање у ћирилицу - дуал распоред. Доле се налази поље за унос текста на ћирилици. Испод поља се налазе дугмад за конвертовање у латиницу, као и опција да конвертовање у латиницу - дуал распоред. Када унесете текст у поље за унос текста, кликните на једну од опција за превођење текста. Након тога, текст ће бити преведен у друго поље за унос текста.';
        $a->url = 'http://rvukovic.net/cirilizator.html';
        $a->objavljen = true;
        $a->save();

        $a = new Alat();
        $a->naziv = 'Latinica у ћирилицу';
        $a->opis = 'Алат има више опција. Главне опције су онлине конвертор, конвертор за Ворд, конвертор за Ексел и ћирилизатор. Онлине конвертор је намењен за унос текста на латиници и превођење у ћирилицу. На страници имамо два поља за унос текста. Изнад сваког поља за унос имамо опцију да изаберемо да ли ћемо уносити текст на латиници, ћирилици, ”аутоматски закључи”, ошишана латиница, YUSCII латинице, YUSCII ћирилице. Када унесете текст у поље за унос текста, он се аутоматски преведе у друго поље за унос текста.';
        $a->url = 'https://latinicaucirilicu.rs/';
        $a->objavljen = true;
        $a->save();

    }
}
