@extends('layouts.public')
@section('content')
    <div class="container my-5 col-8">
        <section class="d-flex align-items-center pt-4 breadcrumbs-section">
            {{ Breadcrumbs::render('razvoj') }}
        </section>
        <h1>{{ $title }}</h1>
        <br>
        <a href="{{ route('alat.alati') }}">
            <h3>Алати</h3>
        </a>
        <p>
            Фонтови играју кључну улогу у дизајну пружајући визуелни идентитет, тон и побољшавајући читљивост. За дизајнере који стварају садржај на српском, доступност различитих ћириличних фонтова је од суштинског значаја, омогућавајући им усаглашавање са културним нијансама и постизање хармоничне комбинације естетског привлачења и језичке аутентичности у њиховим дизајнима.
        </p>
        <hr>
        <a href="{{ route('uputstva') }}">
            <h3>Упутства</h3>
        </a>
        <p>        
            Фонтови играју кључну улогу у дизајну пружајући визуелни идентитет, тон и побољшавајући читљивост. За дизајнере који стварају садржај на српском, доступност различитих ћириличних фонтова је од суштинског значаја, омогућавајући им усаглашавање са културним нијансама и постизање хармоничне комбинације естетског привлачења и језичке аутентичности у њиховим дизајнима.
        </p>
        <hr>
    </div>
    <style>
        .breadcrumbs-section {
            height: 70px;
        }
        p{
            font-size: 17px;
        }
    </style>
@endsection